---
kind: type
id: T:Autodesk.Revit.DB.HorizontalTextAlignment
source: html/f904dd9f-28ce-00fe-352f-03fd869e4199.htm
---
# Autodesk.Revit.DB.HorizontalTextAlignment

Supported types of horizontal alignment of a text element and text justification within the text containing box.

## Syntax (C#)
```csharp
public enum HorizontalTextAlignment
```